zhiyanggao/gd32e508_zephyr/modules/hal/gigadevice/include/dt-bindings/pinctrl/gd32e508z(e-c)xx-pinctrl.h
/* CK_OUT */
#define CK_OUT_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* CMP1_IM4 */
#define CMP1_IM4_PA4 \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, NORMP)

/* CMP1_IM5 */
#define CMP1_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP1_IM6 */
#define CMP1_IM6_PA2 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)

/* CMP1_IP */
#define CMP1_IP_PA7 \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, NORMP)

/* CMP1_OUT */
#define CMP1_OUT_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)
#define CMP1_OUT_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)
#define CMP1_OUT_PB9 \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, NORMP)
#define CMP1_OUT_PE8 \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, NORMP)
#define CMP1_OUT_PE13 \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, NORMP)

/* CMP3_IM4 */
#define CMP3_IM4_PA4 \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, NORMP)

/* CMP3_IM5 */
#define CMP3_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP3_IM7 */
#define CMP3_IM7_PB2 \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)

/* CMP3_IP */
#define CMP3_IP_PB0 \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, NORMP)

/* CMP3_OUT */
#define CMP3_OUT_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)
#define CMP3_OUT_PE9 \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, NORMP)
#define CMP3_OUT_PE12 \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, NORMP)

/* CMP5_IM4 */
#define CMP5_IM4_PA4 \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, NORMP)

/* CMP5_IM5 */
#define CMP5_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP5_IM7 */
#define CMP5_IM7_PB15 \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)

/* CMP5_IP */
#define CMP5_IP_PB11 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, NORMP)

/* CMP5_OUT */
#define CMP5_OUT_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)
#define CMP5_OUT_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)
#define CMP5_OUT_PE10 \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, NORMP)
#define CMP5_OUT_PE11 \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, NORMP)

/* CTC_SYNC */
#define CTC_SYNC_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, CTC_NORMP)
#define CTC_SYNC_PD15_PRMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, CTC_PRMP)
#define CTC_SYNC_PF0_FRMP \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, CTC_FRMP)

/* DAC_OUT0 */
#define DAC_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* ETH_MII_COL */
#define ETH_MII_COL_PA3 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, NORMP)

/* ETH_MII_CRS */
#define ETH_MII_CRS_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* ETH_MII_MDC */
#define ETH_MII_MDC_PC1 \
	GD32_PINMUX_AFIO('C', 1, ALTERNATE, NORMP)

/* ETH_MII_MDIO */
#define ETH_MII_MDIO_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* ETH_MII_PPS_OUT */
#define ETH_MII_PPS_OUT_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* ETH_MII_RXD0 */
#define ETH_MII_RXD0_PC4_NORMP \
	GD32_PINMUX_AFIO('C', 4, GPIO_IN, ETH_NORMP)
#define ETH_MII_RXD0_PD9_RMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, ETH_RMP)

/* ETH_MII_RXD1 */
#define ETH_MII_RXD1_PC5_NORMP \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, ETH_NORMP)
#define ETH_MII_RXD1_PD10_RMP \
	GD32_PINMUX_AFIO('D', 10, GPIO_IN, ETH_RMP)

/* ETH_MII_RXD2 */
#define ETH_MII_RXD2_PB0_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, ETH_NORMP)
#define ETH_MII_RXD2_PD11_RMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, ETH_RMP)

/* ETH_MII_RXD3 */
#define ETH_MII_RXD3_PB1_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, ETH_NORMP)
#define ETH_MII_RXD3_PD12_RMP \
	GD32_PINMUX_AFIO('D', 12, GPIO_IN, ETH_RMP)

/* ETH_MII_RX_CLK */
#define ETH_MII_RX_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)

/* ETH_MII_RX_DV */
#define ETH_MII_RX_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, ETH_NORMP)
#define ETH_MII_RX_DV_PD8_RMP \
	GD32_PINMUX_AFIO('D', 8, GPIO_IN, ETH_RMP)

/* ETH_MII_RX_ER */
#define ETH_MII_RX_ER_PB10 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, NORMP)

/* ETH_MII_TXD0 */
#define ETH_MII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ETH_MII_TXD1 */
#define ETH_MII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ETH_MII_TXD2 */
#define ETH_MII_TXD2_PC2 \
	GD32_PINMUX_AFIO('C', 2, ALTERNATE, NORMP)

/* ETH_MII_TXD3 */
#define ETH_MII_TXD3_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)

/* ETH_MII_TX_CLK */
#define ETH_MII_TX_CLK_PC3 \
	GD32_PINMUX_AFIO('C', 3, GPIO_IN, NORMP)

/* ETH_MII_TX_EN */
#define ETH_MII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* ETH_RMII_CRS_DV */
#define ETH_RMII_CRS_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, ETH_NORMP)
#define ETH_RMII_CRS_DV_PD8_RMP \
	GD32_PINMUX_AFIO('D', 8, GPIO_IN, ETH_RMP)

/* ETH_RMII_MDC */
#define ETH_RMII_MDC_PC1 \
	GD32_PINMUX_AFIO('C', 1, ALTERNATE, NORMP)

/* ETH_RMII_MDIO */
#define ETH_RMII_MDIO_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* ETH_RMII_PPS_OUT */
#define ETH_RMII_PPS_OUT_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* ETH_RMII_REF_CLK */
#define ETH_RMII_REF_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)

/* ETH_RMII_RXD0 */
#define ETH_RMII_RXD0_PC4_NORMP \
	GD32_PINMUX_AFIO('C', 4, GPIO_IN, ETH_NORMP)
#define ETH_RMII_RXD0_PD9_RMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, ETH_RMP)

/* ETH_RMII_RXD1 */
#define ETH_RMII_RXD1_PC5_NORMP \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, ETH_NORMP)
#define ETH_RMII_RXD1_PD10_RMP \
	GD32_PINMUX_AFIO('D', 10, GPIO_IN, ETH_RMP)

/* ETH_RMII_TXD0 */
#define ETH_RMII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ETH_RMII_TXD1 */
#define ETH_RMII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ETH_RMII_TX_EN */
#define ETH_RMII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* EXMC_A0 */
#define EXMC_A0_PF0 \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, NORMP)

/* EXMC_A1 */
#define EXMC_A1_PF1 \
	GD32_PINMUX_AFIO('F', 1, ALTERNATE, NORMP)

/* EXMC_A10 */
#define EXMC_A10_PG0 \
	GD32_PINMUX_AFIO('G', 0, ALTERNATE, NORMP)

/* EXMC_A11 */
#define EXMC_A11_PG1 \
	GD32_PINMUX_AFIO('G', 1, ALTERNATE, NORMP)

/* EXMC_A12 */
#define EXMC_A12_PG2 \
	GD32_PINMUX_AFIO('G', 2, ALTERNATE, NORMP)

/* EXMC_A13 */
#define EXMC_A13_PG3 \
	GD32_PINMUX_AFIO('G', 3, ALTERNATE, NORMP)

/* EXMC_A14 */
#define EXMC_A14_PG4 \
	GD32_PINMUX_AFIO('G', 4, ALTERNATE, NORMP)

/* EXMC_A15 */
#define EXMC_A15_PG5 \
	GD32_PINMUX_AFIO('G', 5, ALTERNATE, NORMP)

